In [91]:
import pandas as pd#데이터분석할때 필요!
import numpy as np#수치계산할때 씀
#데이터분석하려면 이 2개는 꼭 import해야함.

In [92]:
#dataframe == schema(db, table)

In [93]:
#dataframe을 만드는 방법
#1.외부파일을 읽어온다. (컴마로 연결된 csv, xlsx등)
#2. 데이터구조를 가지고 dataframe을 만들어주면 된다.
#   dic, list등

In [94]:
#항목명1 항목명2  항목명3 ==>dic(딕셔너리)의 key
#-------------------------
#100     200      300     ==>dic(val, list)딕셔너리의 value값이 리스트로 되어있다. 
#200     220      330

#{"항목명1" : [100,200],"항목명2" : [200,220]}

In [33]:
df = pd.DataFrame({"name" : ['홍길동', '박길동'], "age" : [100,30], "ex" : [1,2]})
#딕셔너리라서 꼭 중괄호 써줘야함. 그 안에 key:value들어감
df

  name  age  ex
0  홍길동  100   1
1  박길동   30   2

In [34]:
df['name']#dtype: object (str일때 object로 뜸)

0    홍길동
1    박길동
Name: name, dtype: object

In [67]:
df['age'][df['age']>50]#df['age']옆에 대괄호에 넣은[df['age']>50]코드를 입력하면 조건이 된다.
#df[컬럼명][조건]:조건이 true인 것만 추출!
#dtype: int64 (int일때 int64로 뜸)

0    100
Name: age, dtype: int64

In [70]:
df.loc[0]#loc[행,열]:행과열을 추출#loc[행]:행을 추출

name    홍길동
age     100
ex        1
Name: 0, dtype: object

In [71]:
df.loc[:, 'age']#콜론만쓰면 전체영역의 행

0    100
1     30
Name: age, dtype: int64

In [72]:
df.loc[:,'name':'age']#'name':'age' 콜론은 범위를 나타내는 기호 name열~age열을 추출.

  name  age
0  홍길동  100
1  박길동   30

In [73]:
df['add_colum'] = df['age'] + df['ex']
#기본의 컬럼에 새로운 컬럼 추가 가능(파생한다,파생 변수)
#df[새로 만들고 싶은 컬럼명] = df[기존 컬럼] + df[기존 컬럼]
df

  name  age  ex  add_colum
0  홍길동  100   1        101
1  박길동   30   2         32

In [74]:
df['next_age'] = df['age'] + 1
df

  name  age  ex  add_colum  next_age
0  홍길동  100   1        101       101
1  박길동   30   2         32        31

In [75]:
df.loc[0, 'name']#loc는 인덱스 사용 불가.값을 넣어줘야함.

'홍길동'

In [76]:
df.iloc[0,0]#인덱스를 사용하고 싶으면 iloc를 사용하면 된다.(위치)

'홍길동'

In [77]:
df.iloc[0,3]

101

In [78]:
df.iloc[1,4]

31

In [81]:
df.iloc[0,3] = 200
df

  name  age  ex  add_colum  next_age
0  홍길동  100   1        200       101
1  박길동   30   2         32        31

In [83]:
df.iloc[1,4] = 300#1,4전부 인덱스여야함!!
df

  name  age  ex  add_colum  next_age
0  홍길동  100   1        200       101
1  박길동   30   2         32       300

In [85]:
df.columns

Index(['name', 'age', 'ex', 'add_colum', 'next_age'], dtype='object')

In [86]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [87]:
df.values#중요!!중요오오오옹오오오오!!!!!!!!!!!!!
#-->ndarray클래스로 리턴(넘버차원클래스),
#n: 숫자(차원수, 1차원이면1, 2차원이면 2)
#d: 차원(dimension)
#arrray: 리스트
#판다스에서는 여러 차원의 데이터를 하나의 클래스로 처리하기 위해서 
#여러 차원의 데이터를 다룰 수 있는 nbarray클래스를 만들어 놓았음.
#df.values는 2차원으로 리턴해주고 있다.

array([['홍길동', 100, 1, 200, 101],
       ['박길동', 30, 2, 32, 300]], dtype=object)

In [ ]:
df.set_index('ex')

In [36]:
df.describe()#describe:상세히 설명하다.수치항목에 대해서만 요약해줌!!(str은 안해줌)
#데이터프래임안에 있는 내용의
#개수,평균(mean),표준편차(std),최소값(min),최대값(max),
#25% 50% 75% 100%(max):4분위 수

              age        ex
count    2.000000  2.000000
mean    65.000000  1.500000
std     49.497475  0.707107
min     30.000000  1.000000
25%     47.500000  1.250000
50%     65.000000  1.500000
75%     82.500000  1.750000
max    100.000000  2.000000

In [37]:
import random

In [38]:
name_list = []
age_list = []
ex_list = []
for i in range(1000):
    name_list.append('이름'+str(i))
    age_list.append(random.randint(1, 120))
    ex_list.append(random.randint(1,2))
len(name_list)
len(age_list)
len(ex_list)

1000

In [39]:
name_list[:5]#index 0~4, 5개를 print

['이름0', '이름1', '이름2', '이름3', '이름4']

In [40]:
name_list[995:]#맨 끝 5개 찍어보기

['이름995', '이름996', '이름997', '이름998', '이름999']

In [41]:
age_list[:5]

[76, 17, 112, 99, 96]

In [42]:
ex_list[:5]

[1, 1, 2, 2, 2]

In [ ]:
#1. df로 만들어보고
#2. 데이터타입을 확인해보고,
#3. 각 컬럼 추출해보기,
#4.숫자형 컬럼의 요약을 해보세요.

In [49]:
df2 = pd.DataFrame({"name":name_list, "age": age_list, "ex":ex_list})
df2

      name  age  ex
0      이름0   76   1
1      이름1   17   1
2      이름2  112   2
3      이름3   99   2
4      이름4   96   2
..     ...  ...  ..
995  이름995   10   1
996  이름996   90   1
997  이름997   39   2
998  이름998   18   1
999  이름999   64   2

[1000 rows x 3 columns]

In [51]:
type(df2['name'])

pandas.core.series.Series

In [52]:
df2.dtypes#각 컬럼의 데이터타입을 볼 수 있다.

name    object
age      int64
ex       int64
dtype: object

In [53]:
df2['age']#데이터프레임[컬럼명]

0       76
1       17
2      112
3       99
4       96
      ...
995     10
996     90
997     39
998     18
999     64
Name: age, Length: 1000, dtype: int64

In [55]:
df2['age'] > 50#50이상이면 true계산까지 해줌.#브로드캐스팅:하나의 연산이 많은 영역에 영향을 미치는 것.

0       True
1      False
2       True
3       True
4       True
       ...
995    False
996     True
997    False
998    False
999     True
Name: age, Length: 1000, dtype: bool

In [57]:
df2['age'] - 10#브로드캐스팅(-10을 천개 해줌.)
#원본을 가져다가 처리하므로, df2는 바뀌지 않음.
#비파괴 연산

0       66
1        7
2      102
3       89
4       86
      ...
995      0
996     80
997     29
998      8
999     54
Name: age, Length: 1000, dtype: int64

In [58]:
df2['age']

0       76
1       17
2      112
3       99
4       96
      ...
995     10
996     90
997     39
998     18
999     64
Name: age, Length: 1000, dtype: int64

In [59]:
df2['age'] = df2['age']-10#이렇게 덮어쓰기 하면 원본이 바뀜

In [60]:
df2['age']#원본이 -10된 걸로 바뀜

0       66
1        7
2      102
3       89
4       86
      ...
995      0
996     80
997     29
998      8
999     54
Name: age, Length: 1000, dtype: int64

In [62]:
df2['name'] = df2['name']+'님'
df2['name']

0        이름0님님
1        이름1님님
2        이름2님님
3        이름3님님
4        이름4님님
        ...
995    이름995님님
996    이름996님님
997    이름997님님
998    이름998님님
999    이름999님님
Name: name, Length: 1000, dtype: object

In [65]:
df2.describe()

               age           ex
count  1000.000000  1000.000000
mean     49.109000     1.494000
std      34.349775     0.500214
min      -9.000000     1.000000
25%      18.000000     1.000000
50%      49.000000     1.000000
75%      78.250000     2.000000
max     110.000000     2.000000